backend/app/controllers/apireader_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IS NULL LIMIT 1
SELECT "categories".* FROM "categories"
SELECT "transactions".* FROM "transactions" WHERE "transactions"."category_id" = 1
---
  def index2
	data = Array.new

	expenses = Transaction.find_by_sql("SELECT sum(amount) as expenses FROM transactions WHERE amount < 0").first.expenses
	data << _get_data_item("Expenses", expenses)

	income = Transaction.find_by_sql("SELECT sum(amount) as income FROM transactions WHERE amount > 0").first.income
	data << _get_data_item("Income", income)

  categories = Category.find(:all)

  categories.each do |category|
    if category.parent then
      sum = 0
      category.transactions.each do |transaction|